# combining_reshaping_data

# Merging and joining Data Frames

In [2]:
import pandas as pd
import numpy as np
import datetime 
customers={'customer_id':[1234,1235,1111,2222,3334,3333,4444,5555],
             'Name':['Mike', 'Maria', 'Nasir', 'Ali',"Ahmed", 'Saad',"Hamid", "Kami"],
             'Address':['abc23-1', 'xyz-3','abc23-2', 'xyz-5','abc23-6', 'xyz-0','abc23-11', 'xyz-301'],
             }
customers=pd.DataFrame(customers)
customers

   customer_id   Name   Address
0         1234   Mike   abc23-1
1         1235  Maria     xyz-3
2         1111  Nasir   abc23-2
3         2222    Ali     xyz-5
4         3334  Ahmed   abc23-6
5         3333   Saad     xyz-0
6         4444  Hamid  abc23-11
7         5555   Kami   xyz-301

In [3]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  8 non-null      int64
 1   Name         8 non-null      object
 2   Address      8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [5]:
#customers.set_index('Customer_id')

In [6]:
orders={
    'customer_id':[1234,1235,1234,1234,1235,1267,1237,1890],
          'order_id':[11,22,33,44,55,66,77,88],
         'order_date':[datetime.date(2023,2,1),datetime.date(2023,1,1),
                       datetime.date(2023,2,2),datetime.date(2023,1,1),
                       datetime.date(2023,2,3),datetime.date(2023,1,2),
                       datetime.date(2023,2,4),datetime.date(2023,1,2)],
}

In [8]:
orders=pd.DataFrame(orders)
orders

   customer_id  order_id  order_date
0         1234        11  2023-02-01
1         1235        22  2023-01-01
2         1234        33  2023-02-02
3         1234        44  2023-01-01
4         1235        55  2023-02-03
5         1267        66  2023-01-02
6         1237        77  2023-02-04
7         1890        88  2023-01-02

In [11]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  8 non-null      int64
 1   order_id     8 non-null      int64
 2   order_date   8 non-null      object
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

# Merge Data
-Inner
-Outer
-Left
-Right

In [14]:
#inner merge >> intersection
merged_data=pd.merge(customers,orders)

In [15]:
merged_data.sort_values(by='customer_id',ascending=Flase)

NameError: name 'Flase' is not defined